{
    "Career": {
        "Big Nerd Ranch (Remote)": {
            "logo": "BigNerdRanch",
            "titles": {
                "Solutions Architect, Machine Learning": "07-2021 | ...",
                "Senior Machine Learning Engineer": "06-2020 | 07-2021",
                "Software Engineer": "04-2018 | 06-2018"
            },
            "task": {
                "Computer Vision & On Device Model Creation": [
                    "Rapid prototype proof of concepts for viability.",
                    "Developed methods on data collection and labeling to create data sets.",
                    "Created models that outperformed the initial OpenCV implementation.",
                    "Developed custom Core ML converters to plug object detectors directly into Apples Vision Framework",
                    "Created models served on-device for both iOS and Android."
                ],
                "Predictive Modeling & Algorithm Development": [
                    "Predicted order cook times to enable optimized driver routing and pickups times.",
                    "Determined optimal model architecture to balance performance with operating cost.",
                    "Created ML systems able to process and train models using hundreds of millions of rows of data.",
                    "Developed algorithms to detect abnormalities and best correct the data.",
                    "Consulted on multi-sensor systems to accurately locate vehicles in parking lots."
                ],
                "MLOps & Full Stack Model Development": [
                    "Created automated AWS production pipelines using micro-service architecture ",
                    "Lead model development through data gathering, processing, model creation, and deployment."
                ],
                "Leadership & Mentoring": [
                    "Creation of ML standards, best practices, and tooling for building out an ML department",
                    "Worked on the creation of a training plan to develop more ML engineers within the company",
                    "Lead technical interviews and involved in technical sales of ML services.",
                    "Held meetings to share knowledge and processes of projects."
                ],
                "Web & iOS Development ": [
                    "Developed web and iOS applications for companies ranging from startups to Fortune 10 companies.",
                    "Created on-device camera pipelines for high frame rate image capture.",
                    "Lead accessibility, testing, and performance optimization efforts."
                ]
            }
        },
        "ClusterTruck": {
            "logo": "ClusterTruck",
            "titles": {
                "Software Engineer": "07-2017 | 03-2018"
            },
            "task": {
                "Web & iOS Development": [
                    "Developed and Maintained driver applications written for iOS and Web",
                    "Developed full-stack features in Rails, Postgres, and Redis",
                    "Implemented highly detailed iOS animations"
                ],
                "Geo Positioning & Fencing": [
                    "Dealt with GPS data from driver applications inside SQL and Rails systems to manage driver loads."
                ],
                "UX Research Studies": [
                    "Worked with the Director of UX to conduct studies on the driver application and create new features and improvements."
                ],
                "Leadership": [
                    "Participated in high-level company planning meetings and new restaurant rollouts."
                ]
            }
        },
        "Proposable(Remote)": {
            "logo": "Proposable",
            "titles": {
                "Rails Developer": "05-2016 | 07-2017"
            },
            "task": {
                "Full-Stack Web & Analytic Tooling": [
                    "Developed new features that enabled new goods for sale.",
                    "Developed analytics tooling for proposal tracking.",
                    "Created email templates and a highly configurable white labeling system."
                ]
            }
        }
    }
}
